УТ_для_edt/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Назначения</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <type>
      <types>EnumRef.ТипыНазначений</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудованиеТипНазначения</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>EnumRef.смартТипыНазначенийРазобранногоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудование</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудованиеСерия</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРазобранноеОборудованиеУзел</name>
    <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПричинаВыводаИзОборота</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>EnumRef.смартПричиныВыводаТоваровИзОборота</types>
    </type>
  </attributes>
  <attributes>
    <name>смартУточнениеПричиныВыводаИзОборота</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВыведеннаяИзОборотаНоменклатура</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВыведеннаяИзОборотаСерия</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Enums/ТипыНазначений/ТипыНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНазначений</name>
  <enumValues>
    <name>Собственное</name>
  </enumValues>
  <enumValues>
    <name>Давальческое21</name>
  </enumValues>
  <enumValues>
    <name>ДавальческоеПродукция22</name>
  </enumValues>
  <enumValues>
    <name>ДавальческоеМатериалы22</name>
  </enumValues>
  <enumValues>
    <name>ДавальческоеМатериалыПодЭтап22</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереработчик</name>
  </enumValues>
  <enumValues>
    <name>смартТоварВыведенныйИзОборота</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартПричиныВыводаТоваровИзОборота/смартПричиныВыводаТоваровИзОборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартПричиныВыводаТоваровИзОборота</name>
  <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>ВнутриУпаковкиЗапчасти</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеОборудования</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>НеКомплект</name>
  </enumValues>
  <enumValues>
    <name>НеприкосновенныйЗапас</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>Пересорт</name>
  </enumValues>
  <enumValues>
    <name>ПодСписание</name>
  </enumValues>
  <enumValues>
    <name>ПодУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПодозрениеНаБрак</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаНаЦелостностьИТоварныйВид</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/Назначения/Forms/смартФормаСозданияНазначения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Номенклатура", 	Номенклатура);
	Параметры.Свойство("Серия", 		Серия);
	Заголовок				= СтрШаблон("Вывод из оборота %1%2", Номенклатура, ?(ЗначениеЗаполнено(Серия), ", " + Серия, ""));
	ТипНазначения   		= Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота;
	ПредставлениеНазначения = СформироватьПредставление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПричинаВыводаТоваровИзОборотаПриИзменении(Элемент) 
	ПредставлениеНазначения = СформироватьПредставление();
	Элементы.УточнениеПричиныВыводаИзОборота.Видимость = ПричинаВыводаТоваровИзОборота = ПредопределенноеЗначение("Перечисление.смартПричиныВыводаТоваровИзОборота.Другое");
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНазначенияПриИзменении(Элемент)
	ПредставлениеНазначения = СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура УточнениеПричиныВыводаИзОборотаПриИзменении(Элемент)
	ПредставлениеНазначения = СформироватьПредставление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	Если НЕ ЗначениеЗаполнено(ПричинаВыводаТоваровИзОборота) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите причину вывода товара из оборота", , "ПричинаВыводаТоваровИзОборота");
		Возврат;
	КонецЕсли;
	Если ПричинаВыводаТоваровИзОборота = ПредопределенноеЗначение("Перечисление.смартПричиныВыводаТоваровИзОборота.Другое")
		И НЕ ЗначениеЗаполнено(УточнениеПричиныВыводаИзОборота) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уточните причину вывода товара из оборота", , "УточнениеПричиныВыводаИзОборота");
		Возврат;
	КонецЕсли;

	НовоеНазначениеСсылка = СоздатьНовоеНазначение(); 
	Если НЕ НовоеНазначениеСсылка = Неопределено Тогда
		Закрыть(НовоеНазначениеСсылка); 
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось записать новое назначение!");
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция СоздатьНовоеНазначение()  
	УстановитьПривилегированныйРежим(Истина);
	НазначениеОбъект = Справочники.Назначения.СоздатьЭлемент();

	НазначениеОбъект.ТипНазначения           				= ТипНазначения;
	НазначениеОбъект.Наименование            				= ПредставлениеНазначения;
	НазначениеОбъект.ДвиженияПоСкладскимРегистрам 			= Истина;
	НазначениеОбъект.КонтролироватьТолькоНаличие    		= Истина;
    НазначениеОбъект.смартПричинаВыводаИзОборота 			= ПричинаВыводаТоваровИзОборота; 
	Если ПричинаВыводаТоваровИзОборота = ПредопределенноеЗначение("Перечисление.смартПричиныВыводаТоваровИзОборота.Другое") Тогда
		НазначениеОбъект.смартУточнениеПричиныВыводаИзОборота = УточнениеПричиныВыводаИзОборота;
	КонецЕсли;
	
	НазначениеОбъект.смартВыведеннаяИзОборотаНоменклатура	= Номенклатура;
	НазначениеОбъект.смартВыведеннаяИзОборотаСерия          = Серия;
	
	Попытка
		НазначениеОбъект.Записать();
	Исключение 
		Возврат Неопределено;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат НазначениеОбъект.Ссылка;	
КонецФункции  

&НаСервере
Функция СформироватьПредставление()
	
	Возврат СтрШаблон("Товар выведенный из оборота, %1, %2%3",
		?(ПричинаВыводаТоваровИзОборота = ПредопределенноеЗначение("Перечисление.смартПричиныВыводаТоваровИзОборота.Другое"), УточнениеПричиныВыводаИзОборота, ПричинаВыводаТоваровИзОборота),
		Номенклатура,
		?(ЗначениеЗаполнено(Серия), ", " + Серия, ""));
	
КонецФункции

#КонецОбласти
